
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реализация";
	КомандаПечати.ДополнительныеПараметры.Вставить("ЭтоРеализацияТоваровИУслуг");
	КомандаПечати.Представление = НСтр("ru = 'Реализация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 50;
	
	
КонецПроцедуры 

// Формирует печатные формы.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реализация") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Реализация",
		НСтр("ru = 'Реализация'"),
		СформироватьПечатнуюФормуРеализация(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.Реализация.ПФ_MXL_Реализация");
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать

#КонецОбласти  







Функция СформироватьПечатнуюФормуРеализация(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Реализация";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_Реализация");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата КАК Дата,
	|	Реализация.Организация КАК Организация,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Номер КАК Номер,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.Договор КАК Договор,
	|	Реализация.Склад КАК Склад,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&МассивОбъектов)";
	Запрос.Параметры.Вставить("МассивОбъектов",МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслугиСтрока = Макет.ПолучитьОбласть("УслугиСтрока");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТоварыСтрока = Макет.ПолучитьОбласть("ТоварыСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
		
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
		
		ДанныеОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		Если ЗначениеЗаполнено(ДанныеОрганизации) Тогда
			ОбластьШапка.Параметры.Организация = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"),
			ДанныеОрганизации.Наименование);  
			ОбластьПодвал.Параметры.ГлавныйБухгалтер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"),
			ДанныеОрганизации.ГлавныйБухгалтер);  
			ОбластьПодвал.Параметры.Руководитель = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"),
			ДанныеОрганизации.Руководитель);
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка); 
		
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.ММ.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Заполнить(Выборка);  
		
		ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());
		
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		
		Если ВыборкаТовары.Количество() Тогда
			
			ТабДок.Вывести(ОбластьТоварыШапка);
			
			Пока ВыборкаТовары.Следующий() Цикл
				
				ОбластьТоварыСтрока.Параметры.Заполнить(ВыборкаТовары);
				
				ТабДок.Вывести(ОбластьТоварыСтрока, ВыборкаТовары.Уровень());
				
			КонецЦикла;
			
		КонецЕсли;  
		
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		
		Если ВыборкаУслуги.Количество() Тогда
			
			ТабДок.Вывести(ОбластьУслугиШапка);
			
			Пока ВыборкаУслуги.Следующий() Цикл
				
				ОбластьУслугиСтрока.Параметры.Заполнить(ВыборкаУслуги);
				
				ТабДок.Вывести(ОбластьУслугиСтрока, ВыборкаУслуги.Уровень());
				
			КонецЦикла;
			
		КонецЕсли;

		
		ОбластьПодвал.Параметры.Заполнить(Выборка); 
		
		ТабДок.Вывести(ОбластьПодвал);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;  
	
	Возврат ТабДок;
	
КонецФункции