
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		
		Контрагент = ДанныеЗаполнения.Клиент;
		Комментарий = СтрШаблон("Введен на основании: Предварительная запись № %1 от %2",ДанныеЗаполнения.Номер, Формат(ДанныеЗаполнения.Дата,"ДФ=dd.MM.yyyy"));
		Организация = ДанныеЗаполнения.Организация;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		КонецЦикла;
		
	КонецЕсли;  
	
	Ответственный = Пользователи.ТекущийПользователь();  
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	Движения.ТоварыНаСкладах.Записать();
	
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма,
	|	Реализация.Склад КАК Склад,
	|	Реализация.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация КАК Реализация
	|		ПО РеализацияТовары.Ссылка = Реализация.Ссылка
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура,
	|	Реализация.Склад,
	|	Реализация.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма),
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Товары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВТ_Товары.Количество КАК КоличествоВДокументе,
	|	ВТ_Товары.Сумма КАК СуммаВДокументе,
	|	ВТ_Товары.Склад КАК Склад,
	|	ВТ_Товары.Организация КАК Организация,
	|	ВТ_Товары.Номенклатура.СтатьяЗатрат КАК НоменклатураСтатьяЗатрат,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				(Номенклатура, Склад, Организация) В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Номенклатура,
	|						ВТ_Товары.Склад,
	|						ВТ_Товары.Организация
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Товары.Склад = ТоварыНаСкладахОстатки.Склад
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	НоменклатураСтатьяЗатрат,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	КонстантаЗапретить = Константы.ЗапретПроведенияПриОтрицательныхОстатках.Получить();
	
	ВыборкаСтатьяЗатрат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатьяЗатрат.Следующий() Цикл
		
		СуммаСебестоимостиСтатьяЗатрат = 0;
		
		ВыборкаНоменклатура = ВыборкаСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Если ВыборкаНоменклатура.ЭтоТовар Тогда
				
				СтоимостьОбщая = 0;
				
				Превышение = ВыборкаНоменклатура.КоличествоВДокументе - ВыборкаНоменклатура.КоличествоОстаток;
				Если Превышение > 0 Тогда
					
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Превышение остатка по номенклатуре ""%1"" в количестве ""%2""", ВыборкаНоменклатура.НоменклатураПредставление, Превышение));
					
					Если КонстантаЗапретить Тогда
						Отказ = Истина;
					Иначе
						ОбщегоНазначения.СообщитьПользователю("В результате проведения документа образовались отрицательные остатки.");
					КонецЕсли;
					
				КонецЕсли;
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				ОсталосьСписать = ВыборкаНоменклатура.КоличествоВДокументе;
				
				ВыборкаДетальные = ВыборкаНоменклатура.Выбрать();
				Пока ВыборкаДетальные.Следующий() И ОсталосьСписать > 0 И ВыборкаДетальные.КоличествоОстаток > 0 Цикл
					
					Списываем = Мин(ВыборкаДетальные.КоличествоОстаток,ОсталосьСписать);
					
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Номенклатура = ВыборкаДетальные.Номенклатура;
					Движение.Склад = ВыборкаДетальные.Склад;
					Движение.Количество = Списываем;
					Движение.Организация = ВыборкаДетальные.Организация;
					
					Если Списываем = ВыборкаДетальные.КоличествоОстаток Тогда
						СуммаСписания = ВыборкаДетальные.СуммаОстаток;
					Иначе
						СуммаСписания = Списываем / ВыборкаДетальные.КоличествоОстаток * ВыборкаДетальные.СуммаОстаток;
					КонецЕсли;
					
					Движение.Сумма = СуммаСписания;
					
					ОсталосьСписать = ОсталосьСписать - Списываем;
					СтоимостьОбщая = СтоимостьОбщая + Движение.Сумма;
					
					Движение = Движения.Хозрасчетный.Добавить();
					Движение.Период = Дата;
					Движение.Сумма = СуммаСписания;
					Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
					Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
					Движение.СчетКт = ВыборкаНоменклатура.СчетБухгалтерскогоУчета;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальные.Номенклатура;
										
				КонецЦикла;
				
				Если ОсталосьСписать >0 Тогда 
						 
						 Движение = Движения.ТоварыНаСкладах.ДобавитьРасход(); 
						 Движение.Организация = Организация;
						 Движение.Период = Дата; 
						 Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
						 Движение.Склад = Склад;
						 Движение.Количество = ОсталосьСписать;
						 Движение.Сумма = 0;
						 
				 КонецЕсли;

				
				СуммаСебестоимостиСтатьяЗатрат = СуммаСебестоимостиСтатьяЗатрат + СтоимостьОбщая;
				
			КонецЕсли;
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			Движение.Сотрудник = Сотрудник;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = ВыборкаНоменклатура.СуммаВДокументе;
			Движение.Количество = ВыборкаНоменклатура.КоличествоВДокументе;
			Движение.Организация = Организация;
			
		КонецЦикла;
		
		Если СуммаСебестоимостиСтатьяЗатрат > 0 Тогда
			
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СтатьяЗатрат = ВыборкаСтатьяЗатрат.НоменклатураСтатьяЗатрат;
			Движение.Сумма = СуммаСебестоимостиСтатьяЗатрат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	
	 Если ЗначениеЗаполнено(ДокументОснование) И Услуги.Количество()>0 Тогда
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Клиент = Контрагент;
		Движение.ЗаказКлиента = ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры