Процедура ВыполнитьАутентификацию(Логин) Экспорт
	
	
	Соединение    = Новый HTTPСоединение("192.168.0.25",,"MobileClient");
	Запрос        = Новый HTTPЗапрос("beautysalon/hs/users/getUser?username="+Логин);
	Ответ        = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния <> 200 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст =("При попытке аутентификации произошла ошибка! Код: " + Ответ.КодСостояния);
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЕстьПользователь = Булево(ТелоОтвета);
	
	Если ЕстьПользователь Тогда
		АвторизоватьПользователя(Логин);
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ("По логину " + Логин + " пользователь не найден!") ;		
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры    

//Пробовала иначе вывести сообщения 

//Функция ВыполнитьАутентификацию(Логин) Экспорт
//	
//	
//	Соединение    = Новый HTTPСоединение("192.168.0.25",,"MobileClient");
//	Запрос        = Новый HTTPЗапрос("beautysalon/hs/users/getUser?username="+Логин);
//	Ответ        = Соединение.Получить(Запрос);
//	Если Ответ.КодСостояния <> 200 Тогда
//		Возврат Новый Структура("Успех, Сообщение", Ложь, "При попытке аутентификации произошла ошибка! Код: " + Ответ.КодСостояния);
//	КонецЕсли;
//	
//	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
//	
//	ЕстьПользователь = Булево(ТелоОтвета);
//	
//	Если ЕстьПользователь Тогда
//		АвторизоватьПользователя(Логин); 
//		Возврат Новый Структура ("Успех,Сообщение",Истина,"Успешная авторизация");
//	Иначе
//		Возврат Новый Структура("Успех,Сообщение",Ложь, "По логину " + Логин + " пользователь не найден!") ;		
//			
//	КонецЕсли;
//	
//КонецФункции    




Процедура АвторизоватьПользователя(Логин) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин",Логин);
	
	Если ТекущийПользователь.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Логин = Логин;
		НовыйПользователь.Наименование = Логин;
		НовыйПользователь.Записать(); 
		ТекущийПользователь = НовыйПользователь.Ссылка; 
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
	
КонецПроцедуры

Процедура Разлогиниться() Экспорт  
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		// Удаляем пользователя из информационной базы
		ТекущийПользовательИБ.Удалить();
		
		// Теперь удаляем запись из справочника «Пользователи»
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяПользователяИБ", ТекущийПользовательИБ.Имя); // предполагаем, что поле в справочнике называется «ИмяПользователяИБ»
		
		Выборка = Справочники.Пользователи.Выбрать(, Отбор);
		
		Если Выборка.Следующий() Тогда
			ОбъектПользователя = Выборка.ПолучитьОбъект(); // получаем объект записи
			ОбъектПользователя.Удалить(); // удаляем запись
		КонецЕсли;
	КонецЕсли;
	
		
КонецПроцедуры