
Функция getUserGET(Запрос) 
	
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	
	ЗапросПользователи = Новый Запрос;
		

	ЗапросПользователи.Текст = "ВЫБРАТЬ
		
		|	Контрагенты.ПользовательМП КАК ПользовательМП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ПользовательМП = &Логин
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
	ЗапросПользователи.УстановитьПараметр("Логин",Логин);
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	 
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьЗначение(Результат); 
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 	
	Возврат Ответ;
	
	
КонецФункции   

