
&НаКлиенте
Процедура ВыполнитьАутентификацию(Команда)
	
	Если ЭтаФорма.Логин = "" Тогда
		Сообщить("Введите логин пользователя!");
		Возврат;
	КонецЕсли;
	АутентификацияИАвторизация.ВыполнитьАутентификацию(ЭтаФорма.Логин); 
	
	//СообщениеПользователю = Новый СообщениеПользователю;
	//СообщениеПользователю.Текст = Результат.Сообщение;
	//СообщениеПользователю.Сообщить();
	
	ПодключитьОбработчикОжидания("ЗавершитьРаботуСЗадержкой", 3);
	
	//ЗавершитьРаботуСистемы(Ложь, Истина);  
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуСЗадержкой()
    ЗавершитьРаботуСистемы(Ложь, Истина);
КонецПроцедуры