&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость()  
	
КонецПроцедуры

 &НаКлиенте
 Процедура УстановитьВидимость()
	 
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Договор.Видимость = Ложь;
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Ф.И.О"; 
		Элементы.ПользовательМП.Видимость =Истина;
	Иначе
		Элементы.Договор.Видимость = Истина;
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь; 
		Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ПользовательМП.Видимость = Ложь;
	КонецЕсли;

 КонецПроцедуры  

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	
	УстановитьВидимость()
	
КонецПроцедуры 
