&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик) 
	
	ТипКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Плательщик,"ТипКонтрагента");
	Если ТипКонтрагента = ПредопределенноеЗначение ("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;  
	
КонецФункции  

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость();
	
	СтрокаТипПлательщика = "";
	
	Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчётника") Тогда
		Элементы.Договор.Видимость = Ложь;
		СтрокаТипПлательщика = "СправочникСсылка.Сотрудники"; 
	Иначе
		Элементы.Договор.Видимость = Истина;
		СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПлательщика));
		ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;
	КонецЕсли;  
	
	Если Элементы.Договор.Видимость = Истина
		И ЗначениеЗаполнено(Объект.Плательщик) Тогда
		Элементы.Договор.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	КонецЕсли;
	

	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры


