
Процедура ПередЗаписью(Отказ)
	
	ТипОрганизации = ЭтотОбъект.ТипОрганизации;
	ИНН = ЭтотОбъект.ИНН;
	
	ИННСтрока = Строка(ИНН);
	Если ТипОрганизации = ПредопределенноеЗначение ("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		ОжидаемаяДлина = 10;
	ИначеЕсли ТипОрганизации = ПредопределенноеЗначение ("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		ОжидаемаяДлина = 12;
		
	Иначе
		Возврат;
	КонецЕсли;  
		
	Если СтрДлина(ИННСтрока) <> ОжидаемаяДлина Тогда
		
	ОбщегоНазначения.СообщитьПользователю("Неверное количество цифр в ИНН для типа организации '" + ТипОрганизации + "'. Должно быть " + ОжидаемаяДлина + " цифр.Текущая длина: " + СтрДлина(ИННСтрока));
		
		Отказ = Истина; 
	КонецЕсли;	
	

КонецПроцедуры
