&НаКлиенте
Процедура ПриОткрытии (Отказ)  
	
	УстановитьВидимость();
	
КонецПроцедуры  

 

	
&НаКлиенте
  Процедура УстановитьВидимость()

	Если Объект.Бессрочный Тогда 

		Элементы.ДатаОкончания.Видимость = Ложь;

	Иначе

	Элементы.ДатаОкончания.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора();

КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДоговораПриИзменении (Элемент)
	
	СформироватьНаименованиеДоговора(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	
	Если ЗначениеЗаполнено (Объект.Номер)
		И ЗначениеЗаполнено (Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер +" от " + Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy")+" г";
	ИначеЕсли ЗначениеЗаполнено(Объект.Номер)
		И НЕ ЗначениеЗаполнено (Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер;
	Иначе
		Объект.Наименование = " от " + Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy")+" г";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент) 
	
	УстановитьВидимость();
	
КонецПроцедуры
