Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный)Тогда
	Ответственный = Пользователи.ТекущийПользователь(); 
	КонецЕсли; 
	

КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)


ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
Если ДлительностьУслуг = 0 или ДлительностьУслуг =  Null Тогда
	ДлительностьУслуг = 60;
КонецЕсли;
ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг*60; 


КонецПроцедуры


Функция РассчитатьДатуОкончанияЗаписи()
	
	ТЧУслуги = Услуги.Выгрузить(,"Услуга");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги);
	Запрос.Текст=
	"ВЫБРАТЬ
	|    ТЧУслуги.Услуга КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|    &ТЧУслуги КАК ТЧУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
	|ИЗ
	|    ВТ_Номенклатура КАК ВТ_Номенклатура
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|        ПО ВТ_Номенклатура.Номенклатура = Ном.Ссылка";
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		возврат 0;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДлительностьУслуги;
	
КонецФункции

Процедура ОбработкаПроведения (Отказ, Режим) 
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	
	Движение = Движения.ЗаказыКлиентов.ДобавитьПриход();
	Движение.Период = Дата; 
	Движение.Организация = Организация;
	Движение.Клиент = Клиент;
	Движение.ЗаказКлиента = Ссылка;
	Движение.Сумма = Услуги.Итог("Сумма");
	
КонецПроцедуры

