Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный)Тогда
	Ответственный = Пользователи.ТекущийПользователь(); 
	КонецЕсли; 

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УчетЗатрат.Записывать = Истина; 
	Движения.ТоварыНаСкладах.Записывать = Истина;  
	Движения.Хозрасчетный.Записывать = Истина; 
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
     Запрос.Текст= "ВЫБРАТЬ
                   |	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
                   |	СУММА(ПоступлениеТоваровИУслугТовары.Сумма) КАК Сумма,
                   |	ПоступлениеТоваровИУслугТовары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
                   |	ПоступлениеТоваровИУслугТовары.Количество КАК Количество
                   |ИЗ
                   |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ПоступлениеТоваровИУслугТовары.Номенклатура,
                   |	ПоступлениеТоваровИУслугТовары.Номенклатура.СчетБухгалтерскогоУчета,
                   |	ПоступлениеТоваровИУслугТовары.Количество";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		Движение = Движения.ТоварыНаСкладах.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата; 
		Движение.Организация = Организация;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Сумма = Выборка.Сумма;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
				
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты] = Контрагент;
		
	КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст= "ВЫБРАТЬ
	              |	ПоступлениеТоваровИУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	              |	ПоступлениеТоваровИУслугУслуги.Сумма КАК Сумма,
	              |	ПоступлениеТоваровИУслугУслуги.Услуга.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	              |ИЗ
	              |	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеТоваровИУслугУслуги
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровИУслуг КАК ПоступлениеТоваровИУслуг
	              |		ПО ПоступлениеТоваровИУслугУслуги.Ссылка = ПоступлениеТоваровИУслуг.Ссылка
	              |ГДЕ
	              |	ПоступлениеТоваровИУслуг.Ссылка = &Ссылка
	              |ИТОГИ
	              |	СУММА(Сумма)
	              |ПО
	              |	СтатьяЗатрат,
	              |	СчетБухгалтерскогоУчета";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		
		ДвижениеЗатрат = Движения.УчетЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеЗатрат, ВыборкаИтоги);
		ДвижениеЗатрат.Период = Дата; 
		ДвижениеЗатрат.Организация = Организация; 
		
		Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
			Движение.СчетКт = СчетКредита;
			Движение.Период = Дата;
			Движение.Сумма = Выборка.Сумма;
			Движение.Содержание = "Отражено поступление услуг от поставщика";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаИтоги.СтатьяЗатрат);
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, Контрагент);
			
		КонецЦикла;
		
	КонецЦикла;  
	
	
	
КонецПроцедуры
